app/controllers/gallery_images_controller.rb

SELECT * FROM `gallery_images`
---
  def index
    @gallery_images = GalleryImage.all

SELECT * FROM `gallery_images` WHERE (`gallery_images`.`id` = 1)
---
  def show
    @gallery_image = GalleryImage.find(params[:id])

SELECT * FROM `gallery_images` WHERE (`gallery_images`.`id` = 1)
---
  def edit
    @gallery_image = GalleryImage.find(params[:id])

INSERT INTO `gallery_images` (`title`, `url`, `category_id`, `description`, `visible`) VALUES('Dog', '/images/gallery/dog.jpg', 2, 'Dog on a sled. is <b>AMAZING</b> because it poans a girl who listens to ke$ha.', 1)
---
  def create
    @gallery_image = GalleryImage.new(params[:gallery_image])

    respond_to do |format|
      if @gallery_image.save