app/controllers/gallery_categories_controller.rb

  def index
    @gallery_categories = GalleryCategory.all
---
SELECT * FROM `gallery_categories`

  def show
    @gallery_category = GalleryCategory.find(params[:id])
---
SELECT * FROM `gallery_categories` WHERE (`gallery_categories`.`id` = 1)