app/controllers/gallery_controller.rb

  def index
    @categories = GalleryCategory.find_visible
---
SELECT * FROM `gallery_categories` WHERE (`gallery_categories`.`visible` = 1) ORDER BY title

  def show
    @category = GalleryCategory.find(params[:id])
    @images = @category.gallery_images.find_visible
---
SELECT * FROM `gallery_categories` WHERE (`gallery_categories`.`id` = 1)
SELECT * FROM `gallery_images` WHERE (`gallery_images`.`visible` = 1) AND (`gallery_images`.gallery_category_id = 1) ORDER BY title